InformationRegisters/ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СообщениеЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.МЧД003</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщениеЭДОПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗаписьЦентраЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЦентровЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.УчетнаяЗаписьЦентраЭДО
//  Идентификаторы - Массив из см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Идентификатор
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Идентификатор
//  * Значение - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Ссылка
Функция СсылкиПоИдентификаторам(УчетнаяЗаписьЦентраЭДО, Идентификаторы) Экспорт
	
	Результат = Новый Соответствие;
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		Результат.Вставить(Идентификатор, Неопределено);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Идентификатор,
		|	ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Ссылка
		|ИЗ
		|	РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО КАК
		|		ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО
		|ГДЕ
		|	ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Идентификатор В (&Идентификаторы)
		|	И ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.УчетнаяЗаписьЦентраЭДО = &УчетнаяЗаписьЦентраЭДО";
	
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	Запрос.УстановитьПараметр("УчетнаяЗаписьЦентраЭДО", УчетнаяЗаписьЦентраЭДО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Идентификатор, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Ссылки - Массив из см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Ссылка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Ссылка
//  * Значение - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Идентификатор
Функция ИдентификаторыПоСсылкам(Ссылки) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Ссылка,
		|	ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Идентификатор
		|ИЗ
		|	РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО КАК
		|		ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО
		|ГДЕ
		|	ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Ссылка В (&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Выборка.Идентификатор);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Ссылка - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Ссылка
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Идентификатор
Функция ИдентификаторПоСсылке(Ссылка) Экспорт
	
	Возврат ИдентификаторыПоСсылкам(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка))[Ссылка];
	
КонецФункции

// Параметры:
//  Ссылка - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Ссылка
// 
// Возвращаемое значение:
//  Неопределено,Структура:
//  * Идентификатор - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Идентификатор
//  * УчетнаяЗаписьЦентраЭДО - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.УчетнаяЗаписьЦентраЭДО
Функция ПараметрыСинхронизацииОбъекта(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Идентификатор,
		|	ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.УчетнаяЗаписьЦентраЭДО
		|ИЗ
		|	РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО КАК
		|		ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО
		|ГДЕ
		|	ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Неопределено;
	
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("Идентификатор, УчетнаяЗаписьЦентраЭДО",
			Выборка.Идентификатор, Выборка.УчетнаяЗаписьЦентраЭДО);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Идентификатор - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Идентификатор
//  Ссылка - см. РегистрСведений.ИдентификаторыСинхронизируемыхОбъектовЦентраЭДО.Ссылка
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
Процедура Записать(Идентификатор, Ссылка, УчетнаяЗаписьЦентраЭДО) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
	НаборЗаписей.Отбор.УчетнаяЗаписьЦентраЭДО.Установить(УчетнаяЗаписьЦентраЭДО);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Идентификатор = Идентификатор;
	ЗаписьНабора.Ссылка = Ссылка;
	ЗаписьНабора.УчетнаяЗаписьЦентраЭДО = УчетнаяЗаписьЦентраЭДО;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
